# 농사로 api를 이용하여 얻은 csv 파일을 가져와서 
# 데이터를 정제하기 

library(dplyr)
library(tidyr)

DATA_DIR <- "C:\\DataScience_R_Compliation\\myPlanterior\\data"
WORK_DIR <-"C:\\DataScience_R_Compliation\\myPlanterior"

setwd(DATA_DIR)

#load("plantDetailSampling.Rdata")

#data <- read.csv('plantDetailData_copied_1.csv')
#cleanedData <- read.csv('240716_plantDtldata.csv')
airCleaningPlantData <- read.csv('airCleaningPlant.csv')
tmpData <- read.csv('tmpData.csv')

#View(data)
View(cleanedData)
View(airCleaningPlantData)
View(tmpData)

# 잎색깔, 꽃색깔, 열매 색깔의 경우 다른 기준이 필요할 것 같음 .... 생각해보기


# ---- 식물 분류 코드 -------

cleanedData <- cleanedData %>% 
  separate(분류코드명, into = c("분류코드명_1", "분류코드명_2"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(분류코드, into = c("분류코드_1", "분류코드_2"), sep=",", fill = "right")



cleanedData <- cleanedData %>%
  mutate(
    분류코드_1 = case_when(
      분류코드명_1 == "잎보기식물" ~ 072001,
      분류코드명_1 == "잎&꽃보기식물" ~ 072002,
      분류코드명_1 == "꽃보기식물" ~ 072003,
      분류코드명_1 == "열매보기식물" ~ 072004,
      분류코드명_1 == "선인장다육식물" ~ 072005,
      
    ),
    분류코드_2 = case_when(
      분류코드명_2 == "잎보기식물" ~ 072001,
      분류코드명_2 == "잎&꽃보기식물" ~ 072002,
      분류코드명_2 == "꽃보기식물" ~ 072003,
      분류코드명_2 == "열매보기식물" ~ 072004,
      분류코드명_2 == "선인장다육식물" ~ 072005,
    )
  )



# ---- 생육 형태 코드 분류 코드 -------
cleanedData <- cleanedData %>% 
  separate(생육형태코드명, into = c("생육형태코드명_1", "생육형태코드명_2","생육형태코드명_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(생육형태코드, into = c("생육형태코드_1", "생육형태코드_2","생육형태코드_3"), sep=",", fill = "right")



cleanedData <- cleanedData %>%
  mutate(
    생육형태코드_1 = case_when(
      생육형태코드명_1 == "직립형" ~ 054001,
      생육형태코드명_1 == "관목형" ~ 054002,
      생육형태코드명_1 == "덩굴성" ~ 054003,
      생육형태코드명_1 == "풀모양" ~ 054004,
      생육형태코드명_1 == "로제트형" ~ 054005,
      생육형태코드명_1 == "다육형" ~ 054006,
      
    ),
    생육형태코드_2 = case_when(
      생육형태코드명_2 == "직립형" ~ 054001,
      생육형태코드명_2 == "관목형" ~ 054002,
      생육형태코드명_2 == "덩굴성" ~ 054003,
      생육형태코드명_2 == "풀모양" ~ 054004,
      생육형태코드명_2 == "로제트형" ~ 054005,
      생육형태코드명_2 == "다육형" ~ 054006,
      
    ),
    생육형태코드_3 = case_when(
      생육형태코드명_3 == "직립형" ~ 054001,
      생육형태코드명_3 == "관목형" ~ 054002,
      생육형태코드명_3 == "덩굴성" ~ 054003,
      생육형태코드명_3 == "풀모양" ~ 054004,
      생육형태코드명_3 == "로제트형" ~ 054005,
      생육형태코드명_3 == "다육형" ~ 054006,
      
    ),
    
  )






# ---- 실내 정원 구성 코드 분류 코드 -------(최대 ,로 분류된 개수 : 3)-----

cleanedData <- cleanedData %>% 
  separate(실내정원구성코드, into = c("실내정원구성코드_1", "실내정원구성코드_2","실내정원구성코드_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(실내정원구성코드명, into = c("실내정원구성코드명_1", "실내정원구성코드명_2","실내정원구성코드명_3"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    실내정원구성코드_1 = case_when(
      실내정원구성코드명_1 == "상층목" ~ 085001,
      실내정원구성코드명_1 == "중층목" ~ 085002,
      실내정원구성코드명_1 == "하층목" ~ 085003,
      실내정원구성코드명_1 == "지피식물" ~ 085004,

      
    ),
    실내정원구성코드_2 = case_when(
      실내정원구성코드명_2 == "상층목" ~ 085001,
      실내정원구성코드명_2 == "중층목" ~ 085002,
      실내정원구성코드명_2 == "하층목" ~ 085003,
      실내정원구성코드명_2 == "지피식물" ~ 085004,
      
    ),
    실내정원구성코드_3 = case_when(
      실내정원구성코드명_3 == "상층목" ~ 085001,
      실내정원구성코드명_3 == "중층목" ~ 085002,
      실내정원구성코드명_3 == "하층목" ~ 085003,
      실내정원구성코드명_3 == "지피식물" ~ 085004,
      
    ),
    
  )




# ---- 생태 코드 분류 코드 -------(2)----

cleanedData <- cleanedData %>% 
  separate(생태코드, into = c("생태코드_1", "생태코드_2"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(생태코드명, into = c("생태코드명_1", "생태코드명_2"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    생태코드_1 = case_when(
      생태코드명_1 == "일반형" ~ 086001,
      생태코드명_1 == "건조형" ~ 086002,
      생태코드명_1 == "수경형" ~ 086003,
    
    ),
    생태코드_2 = case_when(
      생태코드명_2 == "일반형" ~ 086001,
      생태코드명_2 == "건조형" ~ 086002,
      생태코드명_2 == "수경형" ~ 086003,
      
    )
    
  )


# ---- 잎 마크 코드 분류 코드 -------(4)----

cleanedData <- cleanedData %>% 
  separate(잎마크코드, into = c("잎마크코드_1", "잎마크코드_2", "잎마크코드_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(잎마크코드명, into = c("잎마크코드명_1", "잎마크코드명_2", "잎마크코드명_3"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    잎마크코드_1 = case_when(
      잎마크코드명_1 == "줄무늬" ~ 070001,
      잎마크코드명_1 == "점무늬" ~ 070002,
      잎마크코드명_1 == "잎 가장자리 무늬" ~ 070003,
      잎마크코드명_1 == "기타 (무늬없음 등)" ~ 070004
      
    ),
    잎마크코드_2 = case_when(
      잎마크코드명_2 == "줄무늬" ~ 070001,
      잎마크코드명_2 == "점무늬" ~ 070002,
      잎마크코드명_2 == "잎 가장자리 무늬" ~ 070003,
      잎마크코드명_2 == "기타 (무늬없음 등)" ~ 070004
      
    ),
    잎마크코드_3 = case_when(
      잎마크코드명_3 == "줄무늬" ~ 070001,
      잎마크코드명_3 == "점무늬" ~ 070002,
      잎마크코드명_3 == "잎 가장자리 무늬" ~ 070003,
      잎마크코드명_3 == "기타 (무늬없음 등)" ~ 070004
      
    ),
    
  )

# ---- 발화 계절 코드 분류 코드 -------(4)----
cleanedData <- cleanedData %>% 
  separate(발화계절코드, into = c("발화계절코드_1", "발화계절코드_2", "발화계절코드_3","발화계절코드_4"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(발화계절코드명, into = c("발화계절코드명_1", "발화계절코드명_2", "발화계절코드명_3", "발화계절코드명_4"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    발화계절코드_1 = case_when(
      발화계절코드명_1 == "봄" ~ 073001,
      발화계절코드명_1 == "여름" ~ 073002,
      발화계절코드명_1 == "가을" ~ 073003,
      발화계절코드명_1 == "겨울" ~ 073004
      
    ),
    발화계절코드_2 = case_when(
      발화계절코드명_2 == "봄" ~ 073001,
      발화계절코드명_2 == "여름" ~ 073002,
      발화계절코드명_2 == "가을" ~ 073003,
      발화계절코드명_2 == "겨울" ~ 073004
      
    ),
    발화계절코드_3 = case_when(
      발화계절코드명_3 == "봄" ~ 073001,
      발화계절코드명_3 == "여름" ~ 073002,
      발화계절코드명_3 == "가을" ~ 073003,
      발화계절코드명_3 == "겨울" ~ 073004
      
    ),
    발화계절코드_4 = case_when(
      발화계절코드명_4 == "봄" ~ 073001,
      발화계절코드명_4 == "여름" ~ 073002,
      발화계절코드명_4 == "가을" ~ 073003,
      발화계절코드명_4 == "겨울" ~ 073004
      
    )
    
  )


# ------- 번식 방법 코드 분류 코드 -------
cleanedData <- cleanedData %>% 
  separate(번식방법코드, into = c("번식방법코드_1", "번식방법코드_2", "번식방법코드_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(번식방법코드명, into = c("번식방법코드명_1", "번식방법코드명_2", "번식방법코드명_3"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    번식방법코드_1 = case_when(
      번식방법코드명_1 == "파종" ~ 060001,
      번식방법코드명_1 == "삽목" ~ 060002,
      번식방법코드명_1 == "분주" ~ 060003,
      번식방법코드명_1 == "접목" ~ 060004,
      번식방법코드명_1 == "취목" ~ 060005,
      번식방법코드명_1 == "기타" ~ 060006,
      
      
    ),
    번식방법코드_2 = case_when(
      번식방법코드명_2 == "파종" ~ 060001,
      번식방법코드명_2 == "삽목" ~ 060002,
      번식방법코드명_2 == "분주" ~ 060003,
      번식방법코드명_2 == "접목" ~ 060004,
      번식방법코드명_2 == "취목" ~ 060005,
      번식방법코드명_2 == "기타" ~ 060006,
      
      
    ),
    번식방법코드_3 = case_when(
      번식방법코드명_3 == "파종" ~ 060001,
      번식방법코드명_3 == "삽목" ~ 060002,
      번식방법코드명_3 == "분주" ~ 060003,
      번식방법코드명_3 == "접목" ~ 060004,
      번식방법코드명_3 == "취목" ~ 060005,
      번식방법코드명_3 == "기타" ~ 060006,
      
      
    ),
    
  )


# ----- 광요구도 코드 분류 코드 -----

cleanedData <- cleanedData %>% 
  separate(광요구도코드, into = c("광요구도코드_1", "광요구도코드_2", "광요구도코드_3"), sep="/", fill = "right")

cleanedData <- cleanedData %>% 
  separate(광요구도코드명, into = c("광요구도코드명_1", "광요구도코드명_2", "광요구도코드명_3"), sep="/", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    광요구도코드_1 = case_when(
      광요구도코드명_1 == "낮은 광도(300~800 Lux)" ~ 055001,
      광요구도코드명_1 == "중간 광도(800~1,500 Lux)" ~ 055002,
      광요구도코드명_1 == "높은 광도(1,500~10,000 Lux)" ~ 055003,

    ),
    광요구도코드_2 = case_when(
      광요구도코드명_2 == "낮은 광도(300~800 Lux)" ~ 055001,
      광요구도코드명_2 == "중간 광도(800~1,500 Lux)" ~ 055002,
      광요구도코드명_2 == "높은 광도(1,500~10,000 Lux)" ~ 055003,
      
    ),
    광요구도코드_3 = case_when(
      광요구도코드명_3 == "낮은 광도(300~800 Lux)" ~ 055001,
      광요구도코드명_3 == "중간 광도(800~1,500 Lux)" ~ 055002,
      광요구도코드명_3 == "높은 광도(1,500~10,000 Lux)" ~ 055003,
      
    )
    
  )




# ----- 배치 장소 코드 분류 코드 -----

cleanedData <- cleanedData %>% 
  separate(배치장소코드, into = c("배치장소코드_1", "배치장소코드_2", "배치장소코드_3","배치장소코드_4","배치장소코드_5"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(배치장소코드명, into = c("배치장소코드명_1", "배치장소코드명_2", "배치장소코드명_3","배치장소코드명_4", "배치장소코드명_5"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    배치장소코드_1 = case_when(
      배치장소코드명_1 == "실내 어두운 곳 (실내깊이 500 이상cm)" ~ 055001,
      배치장소코드명_1 == "거실 내측 (실내깊이 300~500cm)" ~ 055002,
      배치장소코드명_1 == "거실 창측 (실내깊이 150~300cm)" ~ 055003,
      배치장소코드명_1 == "발코니 내측 (실내깊이 50~150cm)" ~ 055004,
      배치장소코드명_1 == "발코니 창측 (실내깊이 0~50cm)" ~ 055005,
      배치장소코드명_1 == "습한 곳" ~ 055006,
      배치장소코드명_1 == "넓은 곳" ~ 055007,
      배치장소코드명_1 == "좁은 곳" ~ 055008,
      
    ),
    배치장소코드_2 = case_when(
      배치장소코드명_2 == "실내 어두운 곳 (실내깊이 500 이상cm)" ~ 055001,
      배치장소코드명_2 == "거실 내측 (실내깊이 300~500cm)" ~ 055002,
      배치장소코드명_2 == "거실 창측 (실내깊이 150~300cm)" ~ 055003,
      배치장소코드명_2 == "발코니 내측 (실내깊이 50~150cm)" ~ 055004,
      배치장소코드명_2 == "발코니 창측 (실내깊이 0~50cm)" ~ 055005,
      배치장소코드명_2 == "습한 곳" ~ 055006,
      배치장소코드명_2 == "넓은 곳" ~ 055007,
      배치장소코드명_2 == "좁은 곳" ~ 055008,
      
    ),
    배치장소코드_3 = case_when(
      배치장소코드명_3 == "실내 어두운 곳 (실내깊이 500 이상cm)" ~ 055001,
      배치장소코드명_3 == "거실 내측 (실내깊이 300~500cm)" ~ 055002,
      배치장소코드명_3 == "거실 창측 (실내깊이 150~300cm)" ~ 055003,
      배치장소코드명_3 == "발코니 내측 (실내깊이 50~150cm)" ~ 055004,
      배치장소코드명_3 == "발코니 창측 (실내깊이 0~50cm)" ~ 055005,
      배치장소코드명_3 == "습한 곳" ~ 055006,
      배치장소코드명_3 == "넓은 곳" ~ 055007,
      배치장소코드명_3 == "좁은 곳" ~ 055008,
      
    ),
    배치장소코드_4 = case_when(
      배치장소코드명_4 == "실내 어두운 곳 (실내깊이 500 이상cm)" ~ 055001,
      배치장소코드명_4 == "거실 내측 (실내깊이 300~500cm)" ~ 055002,
      배치장소코드명_4 == "거실 창측 (실내깊이 150~300cm)" ~ 055003,
      배치장소코드명_4 == "발코니 내측 (실내깊이 50~150cm)" ~ 055004,
      배치장소코드명_4 == "발코니 창측 (실내깊이 0~50cm)" ~ 055005,
      배치장소코드명_4 == "습한 곳" ~ 055006,
      배치장소코드명_4 == "넓은 곳" ~ 055007,
      배치장소코드명_4 == "좁은 곳" ~ 055008,
      
    ),
    배치장소코드_5 = case_when(
      배치장소코드명_5 == "실내 어두운 곳 (실내깊이 500 이상cm)" ~ 055001,
      배치장소코드명_5 == "거실 내측 (실내깊이 300~500cm)" ~ 055002,
      배치장소코드명_5 == "거실 창측 (실내깊이 150~300cm)" ~ 055003,
      배치장소코드명_5 == "발코니 내측 (실내깊이 50~150cm)" ~ 055004,
      배치장소코드명_5 == "발코니 창측 (실내깊이 0~50cm)" ~ 055005,
      배치장소코드명_5 == "습한 곳" ~ 055006,
      배치장소코드명_5 == "넓은 곳" ~ 055007,
      배치장소코드명_5 == "좁은 곳" ~ 055008,
      
    ),
    
  )

# ----- 병충해 코드 분류 코드 --------


cleanedData <- cleanedData %>% 
  separate(병충해코드, into = c("병충해코드_1", "병충해코드_2", "병충해코드_3","병충해코드_4"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(병충해코드명, into = c("병충해코드명_1", "병충해코드명_2", "병충해코드명_3","병충해코드명_4"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    병충해코드_1 = case_when(
      병충해코드명_1 == "진딧물" ~ 088001,
      병충해코드명_1 == "응애" ~ 088002,
      병충해코드명_1 == "깍지벌레" ~ 088003,
      병충해코드명_1 == "총채벌레" ~ 088004,
      병충해코드명_1 == "온실가루이" ~ 088005,
      병충해코드명_1 == "개각충" ~ 088006
      
    ),
    병충해코드_2 = case_when(
      병충해코드명_2 == "진딧물" ~ 088001,
      병충해코드명_2 == "응애" ~ 088002,
      병충해코드명_2 == "깍지벌레" ~ 088003,
      병충해코드명_2 == "총채벌레" ~ 088004,
      병충해코드명_2 == "온실가루이" ~ 088005,
      병충해코드명_2 == "개각충" ~ 088006
      
    ),
    병충해코드_3 = case_when(
      병충해코드명_3 == "진딧물" ~ 088001,
      병충해코드명_3 == "응애" ~ 088002,
      병충해코드명_3 == "깍지벌레" ~ 088003,
      병충해코드명_3 == "총채벌레" ~ 088004,
      병충해코드명_3 == "온실가루이" ~ 088005,
      병충해코드명_3 == "개각충" ~ 088006
      
    ),
    병충해코드_4 = case_when(
      병충해코드명_4 == "진딧물" ~ 088001,
      병충해코드명_4 == "응애" ~ 088002,
      병충해코드명_4 == "깍지벌레" ~ 088003,
      병충해코드명_4 == "총채벌레" ~ 088004,
      병충해코드명_4 == "온실가루이" ~ 088005,
      병충해코드명_4 == "개각충" ~ 088006
      
    ),
    
    
  )





# ----- 꽃색상 코드 분류 코드 -----
cleanedData <- cleanedData %>% 
  separate(꽃색상코드, into = c("꽃색상코드_1", "꽃색상코드_2", "꽃색상코드_3","꽃색상코드_4",
                           "꽃색상코드_5","꽃색상코드_6","꽃색상코드_7"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(꽃색상코드명, into = c("꽃색상코드명_1", "꽃색상코드명_2", "꽃색상코드명_3","꽃색상코드명_4",
                            "꽃색상코드명_5","꽃색상코드명_6","꽃색상코드명_7"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    꽃색상코드_1 = case_when(
      꽃색상코드명_1 == "파랑색" ~ 071001,
      꽃색상코드명_1 == "보라색" ~ 071002,
      꽃색상코드명_1 == "분홍색" ~ 071003,
      꽃색상코드명_1 == "빨강색" ~ 071004,
      꽃색상코드명_1 == "오랜지색" ~ 071005,
      꽃색상코드명_1 == "노랑색" ~ 071006,
      꽃색상코드명_1 == "흰색" ~ 071007,
      꽃색상코드명_1 == "혼합색" ~ 071008,
      꽃색상코드명_1 == "기타" ~ 071009
      
    ),
    꽃색상코드_2 = case_when(
      꽃색상코드명_2 == "파랑색" ~ 071001,
      꽃색상코드명_2 == "보라색" ~ 071002,
      꽃색상코드명_2 == "분홍색" ~ 071003,
      꽃색상코드명_2 == "빨강색" ~ 071004,
      꽃색상코드명_2 == "오랜지색" ~ 071005,
      꽃색상코드명_2 == "노랑색" ~ 071006,
      꽃색상코드명_2 == "흰색" ~ 071007,
      꽃색상코드명_2 == "혼합색" ~ 071008,
      꽃색상코드명_2 == "기타" ~ 071009
      
    ),
    꽃색상코드_3 = case_when(
      꽃색상코드명_3 == "파랑색" ~ 071001,
      꽃색상코드명_3 == "보라색" ~ 071002,
      꽃색상코드명_3 == "분홍색" ~ 071003,
      꽃색상코드명_3 == "빨강색" ~ 071004,
      꽃색상코드명_3 == "오랜지색" ~ 071005,
      꽃색상코드명_3 == "노랑색" ~ 071006,
      꽃색상코드명_3 == "흰색" ~ 071007,
      꽃색상코드명_3 == "혼합색" ~ 071008,
      꽃색상코드명_3 == "기타" ~ 071009
      
    ),
    꽃색상코드_4 = case_when(
      꽃색상코드명_4 == "파랑색" ~ 071001,
      꽃색상코드명_4 == "보라색" ~ 071002,
      꽃색상코드명_4 == "분홍색" ~ 071003,
      꽃색상코드명_4 == "빨강색" ~ 071004,
      꽃색상코드명_4 == "오랜지색" ~ 071005,
      꽃색상코드명_4 == "노랑색" ~ 071006,
      꽃색상코드명_4 == "흰색" ~ 071007,
      꽃색상코드명_4 == "혼합색" ~ 071008,
      꽃색상코드명_4 == "기타" ~ 071009
      
    ),
    꽃색상코드_5 = case_when(
      꽃색상코드명_5 == "파랑색" ~ 071001,
      꽃색상코드명_5 == "보라색" ~ 071002,
      꽃색상코드명_5 == "분홍색" ~ 071003,
      꽃색상코드명_5 == "빨강색" ~ 071004,
      꽃색상코드명_5 == "오랜지색" ~ 071005,
      꽃색상코드명_5 == "노랑색" ~ 071006,
      꽃색상코드명_5 == "흰색" ~ 071007,
      꽃색상코드명_5 == "혼합색" ~ 071008,
      꽃색상코드명_5 == "기타" ~ 071009
      
    ),
    꽃색상코드_6 = case_when(
      꽃색상코드명_6 == "파랑색" ~ 071001,
      꽃색상코드명_6 == "보라색" ~ 071002,
      꽃색상코드명_6 == "분홍색" ~ 071003,
      꽃색상코드명_6 == "빨강색" ~ 071004,
      꽃색상코드명_6 == "오랜지색" ~ 071005,
      꽃색상코드명_6 == "노랑색" ~ 071006,
      꽃색상코드명_6 == "흰색" ~ 071007,
      꽃색상코드명_6 == "혼합색" ~ 071008,
      꽃색상코드명_6 == "기타" ~ 071009
      
    ),
    꽃색상코드_7 = case_when(
      꽃색상코드명_7 == "파랑색" ~ 071001,
      꽃색상코드명_7 == "보라색" ~ 071002,
      꽃색상코드명_7 == "분홍색" ~ 071003,
      꽃색상코드명_7 == "빨강색" ~ 071004,
      꽃색상코드명_7 == "오랜지색" ~ 071005,
      꽃색상코드명_7 == "노랑색" ~ 071006,
      꽃색상코드명_7 == "흰색" ~ 071007,
      꽃색상코드명_7 == "혼합색" ~ 071008,
      꽃색상코드명_7 == "기타" ~ 071009
      
    ),
    
    
  )







# ----- 과일색상 코드 분류 코드 -----
cleanedData <- cleanedData %>% 
  separate(과일색코드, into = c("과일색코드_1", "과일색코드_2", "과일색코드_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(과일색코드명, into = c("과일색코드명_1", "과일색코드명_2", "과일색코드명_3"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    과일색코드_1 = case_when(
      과일색코드명_1== "파랑색" ~ 081001,
      과일색코드명_1 == "보라색" ~ 081002,
      과일색코드명_1 == "검정색" ~ 081003,
      과일색코드명_1 == "빨강색" ~ 081004,
      과일색코드명_1 == "오렌지색" ~ 081005,
      과일색코드명_1 == "노랑색" ~ 081006,
      과일색코드명_1 == "흰색" ~ 081007,
      과일색코드명_1 == "혼합색" ~ 081008,
      과일색코드명_1 == "기타" ~ 081009
      
    ),
    과일색코드_2 = case_when(
      과일색코드명_2== "파랑색" ~ 081001,
      과일색코드명_2 == "보라색" ~ 081002,
      과일색코드명_2 == "검정색" ~ 081003,
      과일색코드명_2 == "빨강색" ~ 081004,
      과일색코드명_2 == "오렌지색" ~ 081005,
      과일색코드명_2 == "노랑색" ~ 081006,
      과일색코드명_2 == "흰색" ~ 081007,
      과일색코드명_2 == "혼합색" ~ 081008,
      과일색코드명_2 == "기타" ~ 081009
      
    ),
    과일색코드_3 = case_when(
      과일색코드명_3== "파랑색" ~ 081001,
      과일색코드명_3 == "보라색" ~ 081002,
      과일색코드명_3 == "검정색" ~ 081003,
      과일색코드명_3 == "빨강색" ~ 081004,
      과일색코드명_3 == "오렌지색" ~ 081005,
      과일색코드명_3 == "노랑색" ~ 081006,
      과일색코드명_3 == "흰색" ~ 081007,
      과일색코드명_3 == "혼합색" ~ 081008,
      과일색코드명_3 == "기타" ~ 081009
      
    ),
    
    
  )






# --- 과일 계절 코드 분류 코드 ----
cleanedData <- cleanedData %>% 
  separate(과일계절코드, into = c("과일계절코드_1", "과일계절코드_2", "과일계절코드_3"), sep=",", fill = "right")

cleanedData <- cleanedData %>% 
  separate(과일계절코드명, into = c("과일계절코드명_1", "과일계절코드명_2", "과일계절코드명_3"), sep=",", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    과일계절코드_1 = case_when(
      과일계절코드명_1 == "봄" ~ 087001,
      과일계절코드명_1 == "여름" ~ 087002,
      과일계절코드명_1 == "가을" ~ 087003,
      과일계절코드명_1 == "겨울" ~ 087004
      
    ),
    과일계절코드_2 = case_when(
      과일계절코드명_2 == "봄" ~ 087001,
      과일계절코드명_2 == "여름" ~ 087002,
      과일계절코드명_2 == "가을" ~ 087003,
      과일계절코드명_2 == "겨울" ~ 087004
      
    ),
    과일계절코드_3 = case_when(
      과일계절코드명_3 == "봄" ~ 087001,
      과일계절코드명_3 == "여름" ~ 087002,
      과일계절코드명_3 == "가을" ~ 087003,
      과일계절코드명_3 == "겨울" ~ 087004
      
    ),

    
  )





# ---- 잎 색상 코드 분류 코드 -----
cleanedData <- cleanedData %>% 
  separate(잎색상코드, into = c("잎색상코드_1", "잎색상코드_2", "잎색상코드_3","잎색상코드_4"), sep="/", fill = "right")

cleanedData <- cleanedData %>% 
  separate(잎색상코드명, into = c("잎색상코드명_1", "잎색상코드명_2", "잎색상코드명_3","잎색상코드명_4"), sep="/", fill = "right")


cleanedData <- cleanedData %>%
  mutate(
    잎색상코드_1 = case_when(
      잎색상코드명_1== "녹색, 연두색" ~ 069001,
      잎색상코드명_1 == "금색, 노란색" ~ 069002,
      잎색상코드명_1 == "흰색, 크림색" ~ 069003,
      잎색상코드명_1 == "은색, 회색" ~ 069004,
      잎색상코드명_1 == "빨강, 분홍, 자주색" ~ 069005,
      잎색상코드명_1 == "여러색 혼합" ~ 069006,
      잎색상코드명_1 == "기타" ~ 069007
      
    ),
    잎색상코드_2 = case_when(
      잎색상코드명_2== "녹색, 연두색" ~ 069001,
      잎색상코드명_2 == "금색, 노란색" ~ 069002,
      잎색상코드명_2 == "흰색, 크림색" ~ 069003,
      잎색상코드명_2 == "은색, 회색" ~ 069004,
      잎색상코드명_2 == "빨강, 분홍, 자주색" ~ 069005,
      잎색상코드명_2 == "여러색 혼합" ~ 069006,
      잎색상코드명_2 == "기타" ~ 069007
      
    ),
    잎색상코드_3 = case_when(
      잎색상코드명_3== "녹색, 연두색" ~ 069001,
      잎색상코드명_3 == "금색, 노란색" ~ 069002,
      잎색상코드명_3 == "흰색, 크림색" ~ 069003,
      잎색상코드명_3 == "은색, 회색" ~ 069004,
      잎색상코드명_3 == "빨강, 분홍, 자주색" ~ 069005,
      잎색상코드명_3 == "여러색 혼합" ~ 069006,
      잎색상코드명_3 == "기타" ~ 069007
      
    ),
    잎색상코드_4 = case_when(
      잎색상코드명_4== "녹색, 연두색" ~ 069001,
      잎색상코드명_4 == "금색, 노란색" ~ 069002,
      잎색상코드명_4 == "흰색, 크림색" ~ 069003,
      잎색상코드명_4 == "은색, 회색" ~ 069004,
      잎색상코드명_4 == "빨강, 분홍, 자주색" ~ 069005,
      잎색상코드명_4 == "여러색 혼합" ~ 069006,
      잎색상코드명_4 == "기타" ~ 069007
      
    ),

  
    
    
  )

# ----- ------


# --- 데이터 저장 코드 -----






# cleanedData <- cleanedData %>%
#   mutate(across(everything(), ~ ifelse(is.na(.), "", .)))
# 위 코드는 na 를 빈칸으로 바꾸는 건데 알아서 db에서 null 로 표시됨 





View(cleanedData)
setwd(DATA_DIR)
save.image('plantDetailSampling.Rdata')
#write.csv(cleanedData, "240716_plantDtldata_1.csv",row.names = T)

